phase-4/01-raccoon-rails-app/app/models/raccoon.rb

SELECT AVG("raccoons"."age") FROM "raccoons"
---
  def self.average_age
    self.all.average(:age).to_f