phase-5/03-actionmailer/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "Chett"], ["password_digest", "[FILTERED]"], ["email", "chett.tiller@flatironschool.com"], ["created_at", "2022-09-09 15:19:56.877453"], ["updated_at", "2022-09-09 15:19:56.877453"]]
---
  def create
    user = User.create(user_params)