phase-4/01-raccoon-rails-app/app/controllers/raccoon_controller.rb

  def index
    raccoons = Raccoon.all
---
SELECT "raccoons".* FROM "raccoons" ORDER BY "raccoons"."id" ASC LIMIT ?  [["LIMIT", 1]]

  def create
    raccoon = Raccoon.create(raccoon_params)
---
INSERT INTO "raccoons" ("name", "age", "has_rabies?", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Rocket"], ["age", 34], ["has_rabies?", 0], ["created_at", "2022-08-08 15:57:07.959951"], ["updated_at", "2022-08-08 15:57:07.959951"]]

  def update
    @raccoon.update(raccoon_params)
---
UPDATE "raccoons" SET "has_rabies?" = ?, "updated_at" = ? WHERE "raccoons"."id" = ?  [["has_rabies?", 1], ["updated_at", "2022-08-08 16:02:27.549526"], ["id", 10]]

  def destroy
    @raccoon.destroy
---
DELETE FROM "raccoons" WHERE "raccoons"."id" = ?  [["id", 7]]

  def find_raccoon
    @raccoon = Raccoon.find_by(id: params[:id])
---
SELECT "raccoons".* FROM "raccoons" WHERE "raccoons"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]