phase-5/01-actioncable/actioncable-backend/app/controllers/messages_controller.rb

INSERT INTO "messages" ("content", "room_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "Hell again Duncan"], ["room_id", 1], ["user_id", 1], ["created_at", "2022-08-31 15:02:22.261129"], ["updated_at", "2022-08-31 15:02:22.261129"]]
---
  def create
    message = current_user.messages.create(message_params)

SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def find_room
    @room ||= Room.find_by(id: params[:room_id])