phase-5/01-actioncable/actioncable-backend/app/controllers/rooms_controller.rb

SELECT "messages".* FROM "messages" WHERE "messages"."room_id" = ?  [["room_id", 1]]
SELECT "rooms".* FROM "rooms"
---
  def index
    render json: Room.all, include: :messages