phase-5/01-actioncable/actioncable-backend/app/controllers/sessions_controller.rb

  def login
    user = User.find_by(name: params[:name])
---
SELECT "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "Chett"], ["LIMIT", 1]]